[
  {
	"slide": 1,
	"text": "В классических крестиках-ноликах клетки либо пусты, либо содержат X или O. В квантовой версии каждая клетка — это кубит.\n\nКубит представляет собой суперпозицию состояний |X⟩ и |O⟩, описываемую через выражение |ψ⟩. \n\nПока кубит не измерен, его состояние неопределенно. Это означает, что X и O сосуществуют!",
	"formula": "superposition"
  },
  {
	"slide": 2,
	"text": "Базисные состояния кубита:\n\n|X⟩ =  — \"крестик\"  \n|O⟩  — \"нолик\"\n\nИгра начинается с таких чистых состояний, но вы можете их менять, влияя на угол поворота — это создает суперпозицию.",
	"formula": "basis_states"
  },
  {
	"slide": 3,
	"text": "X-гейт (матрица Паули X) меняет местами |X⟩ и |O⟩.\n\nЭто базовый элемент управления квантовым состоянием. Например, применив X-гейт к |X⟩, мы получаем |O⟩.",
	"formula": "x_gate"
  },
  {
	"slide": 4,
	"text": "В игре вы управляете параметром θ, определяющим степень суперпозиции.\n\nPower задается с помощью слайдера. Он влияет на вероятность выпадения X или O при измерении.",
	"formula": "strategy"
  },
  {
	"slide": 5,
	"text": "Кубит можно привести в суперпозицию:\n\nЭто значит, что в клетке \"немного X и немного O\" одновременно. Но при нажатии — происходит измерение, и состояние схлопывается в X или O.",
	"formula": "superposition"
  },
  {
	"slide": 6,
	"text": "При измерении кубита можно получить результат X или O.
Вероятность каждого из них зависит от параметра неопределённости, который вы задаёте перед ходом.
Формулы выше показывают, как именно этот параметр влияет на вероятность каждого исхода.",
	"formula": "probability"
  },
  {
	"slide": 7,
	"text": "При нажатии на клетку происходит измерение — суперпозиция исчезает, и клетка становится либо X, либо O.\n\nЭто отражает принцип **коллапса волновой функции** в квантовой механике.\n\nПосле измерения результат становится окончательным и необратимым.",
	"formula": "measurement"
  },
  {
	"slide": 8,
	"text": "Выбор θ — это выбор стратегии:  \n- Высокая неопределенность → больше случайности  \n- Низкая — более детерминированный результат\n\nИгра обучает вас интуитивно понимать, как влияют параметры квантового состояния на измерения.",
	"formula": "strategy"
  }
]
